Repository: staslianx/balli
Catalog: balli/Resources/*.lproj/Localizable.strings
Languages: tr

# error.transcription.invalidURL
source: Invalid Cloud Function URL.
tr: Geçersiz Cloud Function URL'si.

# error.transcription.encodingFailed
source: Failed to prepare audio data: %@
tr: Ses verisi hazırlanamadı: %@

# error.transcription.networkError
source: Network error: %@
tr: Ağ hatası: %@

# error.transcription.serverError
source: Server error: %@
tr: Sunucu hatası: %@

# error.transcription.rateLimitExceeded
source: Too many requests. Please wait %d seconds and try again.
tr: Çok fazla istek. Lütfen %d saniye bekleyip tekrar deneyin.

# error.transcription.audioTooLarge
source: Audio file is too large. Please record a shorter message.
tr: Ses dosyası çok büyük. Lütfen daha kısa bir mesaj kaydedin.

# error.transcription.decodingFailed
source: Failed to process response: %@
tr: Yanıt işlenemedi: %@

# error.transcription.noData
source: No data received from server.
tr: Sunucudan veri alınamadı.

# error.dexcom.invalidConfiguration
source: Invalid Dexcom SHARE configuration
tr: Dexcom SHARE yapılandırması geçersiz

# error.dexcom.invalidCredentials
source: Invalid Dexcom SHARE username or password
tr: Dexcom SHARE kullanıcı adı veya şifresi yanlış

# error.dexcom.sessionExpired
source: Dexcom SHARE session expired. Please log in again.
tr: Dexcom SHARE oturumu sona erdi. Lütfen tekrar giriş yapın.

# error.dexcom.serverError
source: Dexcom SHARE server error. Please try again later.
tr: Dexcom SHARE sunucu hatası. Lütfen daha sonra tekrar deneyin.

# error.dexcom.noDataAvailable
source: No data available from SHARE API
tr: SHARE API'den veri alınamıyor

# error.dexcom.decodingError
source: SHARE data format error: %@
tr: SHARE veri formatı hatası: %@

# error.dexcom.apiError
source: SHARE API error: %@
tr: SHARE API hatası: %@

# error.dexcom.httpError
source: SHARE HTTP error (%d): %@
tr: SHARE HTTP hatası (%d): %@

# error.dexcom.invalidResponse
source: Invalid response from SHARE
tr: SHARE'den geçersiz yanıt alındı

# error.dexcom.networkError
source: Network error: %@
tr: Ağ hatası: %@

# error.dexcom.authenticationFailed
source: Dexcom SHARE authentication failed
tr: Dexcom SHARE kimlik doğrulaması başarısız oldu

# recovery.dexcom.invalidCredentials
source: Check your Dexcom SHARE username and password in Settings
tr: Ayarlardan Dexcom SHARE kullanıcı adı ve şifrenizi kontrol edin

# recovery.dexcom.sessionExpired
source: The app will automatically try to reconnect
tr: Uygulama otomatik olarak yeniden bağlanmayı dener

# recovery.dexcom.serverError
source: Try again in a few minutes
tr: Birkaç dakika sonra tekrar deneyin

# recovery.dexcom.noDataAvailable
source: Make sure your Dexcom CGM is working properly
tr: Dexcom CGM'nizin düzgün çalıştığından emin olun

# error.fts5.databaseError
source: Database error: %@
tr: Veritabanı hatası: %@

# error.fts5.invalidQuery
source: Invalid search query: %@
tr: Geçersiz arama sorgusu: %@

# message.saving
source: Saving...
tr: Kaydediliyor...

# message.syncing
source: Syncing...
tr: Senkronize ediliyor...

# message.savingForLater
source: Saving for later...
tr: Daha sonra için kaydediliyor...

# message.retrying
source: Retrying...
tr: Yeniden deneniyor...

# message.loading
source: Loading...
tr: Yükleniyor...

# message.processing
source: Processing...
tr: İşleniyor...

# offline.mealLogging
source: No internet connection. Meal will be synced later.
tr: İnternet bağlantısı yok. Yemek kaydı daha sonra senkronize edilecek.

# offline.retry
source: Will automatically retry when connected.
tr: Bağlantı kurulduğunda otomatik olarak yeniden denenecek.

# offline.queued
source: Queued: %d items waiting
tr: Kuyrukta: %d öğe bekleniyor

# success.mealSaved
source: Meal saved
tr: Yemek kaydedildi

# success.synced
source: Synced
tr: Senkronize edildi

# success.connected
source: Connected
tr: Bağlandı
